_orgs/_drafts/2016-11-13-cygwin.org
#+TITLE:    windows环境下安装Cygwin
#+AUTHOR:   赵仁贵
#+EMAIL:    zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:2 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD:    <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 
# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

#+BEGIN_CENTER 
  Don't forget to answer the sum up questions in your email message!
#+END_CENTER 

* 写在前面
: 
* Cygwin简介
#+BEGIN_SRC
Cygwin (/ˈsɪɡwɪn/ sig-win[2]) is a Unix-like environment and command-line interface for Microsoft Windows. Cygwin provides 
native integration of Windows-based applications, data, and other system resources with applications, software tools, and 
data of the Unix-like environment. Thus it is possible to launch Windows applications from the Cygwin environment, as well as 
to use Cygwin tools and applications within the Windows operating context.

Cygwin consists of two parts: a dynamic-link library (DLL) as an API compatibility layer providing a substantial part of the 
POSIX API functionality, and an extensive collection of software tools and applications that provide a Unix-like look and feel.

Cygwin was originally developed by Cygnus Solutions, which was later acquired by Red Hat. It is free and open source 
software, released under the GNU Lesser General Public License version 3.[3] Today it is maintained by employees of Red 
Hat, NetApp and many other volunteers.
#+END_SRC
* 安装Cygwin
** 安装Cygwin
: 略
: 提示：安装软件时，可使用中国科技大学软件源mirrors.ustc.edu.cn/cygwin
** 安装及配置ssh
: 1.运行安装文件
: 2.搜索ssh，在Net类别下选上OpenSSH和OpenSSL两项
: 3.安装完成后，打开Cygwin，输入ssh-host-config
: 当询问if privilege separation should be used 时输入 no . 
: 当询问if sshd should be installed as a service 时输入yes . 
: 当询问about the value of CYGWIN environment variable enter 时输入 ntsec .
: 其余询问均输入 no
: 4.在cygwin中输入 cygrunsrv --start sshd 启动sshd
: 5.打开cygwin，输入 ssh-keygen，当询问要filenames 和 pass phrases 的时候都点回车，接受默认的值
: 6.命令结束后输入 cd ~/.ssh 转到.ssh目录，输入 ls –l 应该包含两个文件：id_rsa.pub 和 id_rsa
: 7.在第8步的窗口（当前目录在.ssh）中输入 cat id_rsa.pub >> authorized_keys
: 8.输入 ssh localhost 启动SSH
* 参考资料
: 1.Cygwin-Official Site:http://cygwin.com/
: 2.Cygwin-Wikipedia:https://en.wikipedia.org/wiki/Cygwin
: 3.Cygwin-百度百科：http://baike.baidu.com/view/3968.htm
: 4.Cygwin在线安装指南：http://www.crifan.com/files/doc/docbook/cygwin_intro/release/htmls/install_cygwin_setup_exe.html
: 
